{
  "coffees": [
    {
      "id": 1,
      "name": "Espresso",
      "url": { "img": "https://github.com/saeed0920/Coffee-s-IMG/blob/main/Espresso.jpg" },
      "description": "A strong and rich coffee, typically served in a small cup. It forms the base for many other coffee drinks.",
      "origin": "Italy",
      "caffeineContent": "High",
      "servingSize": "30-50ml",
      "ingredients": ["Finely ground coffee beans", "Hot water"],
      "flavorProfile": "Bold, concentrated, with a thick crema on top."
    },
    {
      "id": 2,
      "url": { "img": "https://github.com/saeed0920/Coffee-s-IMG/blob/main/Latte.jpg?raw=true" },
      "name": "Latte",
      "description": "A smooth, milky coffee made with one part espresso and three parts steamed milk, often topped with a small amount of foam.",
      "origin": "Italy",
      "caffeineContent": "Medium",
      "servingSize": "240ml",
      "ingredients": ["Espresso", "Steamed milk", "Milk foam"],
      "flavorProfile": "Creamy, mild, with a subtle coffee flavor."
    },
    {
      "id": 3,
      "name": "Cappuccino",
      "url": { "img": "https://github.com/saeed0920/Coffee-s-IMG/blob/main/Cappuccino.jpg" },
      "description": "A balanced coffee drink consisting of equal parts espresso, steamed milk, and milk foam, often topped with cocoa powder or cinnamon.",
      "origin": "Italy",
      "caffeineContent": "Medium",
      "servingSize": "180ml",
      "ingredients": ["Espresso", "Steamed milk", "Milk foam"],
      "flavorProfile": "Rich, creamy, with a strong coffee flavor and a velvety texture."
    },
    {
      "id": 4,
      "name": "Americano",
      "description": "A coffee drink made by diluting an espresso with hot water, resulting in a similar strength to drip coffee but with a different flavor profile.",
      "origin": "USA",
      "caffeineContent": "Medium",
      "servingSize": "240ml",
      "ingredients": ["Espresso", "Hot water"],
      "flavorProfile": "Smooth, mild, with a slightly bitter taste."
    },
    {
      "id": 5,
      "name": "Mocha",
      "url": { "img": "https://github.com/saeed0920/Coffee-s-IMG/blob/main/Mocha.jpg" },
      "description": "A chocolate-flavored variant of a caffe latte, combining espresso, steamed milk, and chocolate syrup or cocoa powder, often topped with whipped cream.",
      "origin": "Yemen",
      "caffeineContent": "Medium",
      "servingSize": "240ml",
      "ingredients": ["Espresso", "Steamed milk", "Chocolate syrup or cocoa powder", "Whipped cream (optional)"],
      "flavorProfile": "Sweet, chocolatey, with a rich coffee undertone."
    },
    {
      "id": 6,
      "name": "Macchiato",
      "description": "A coffee drink made with espresso 'stained' with a small amount of milk or milk foam. The name 'macchiato' means 'stained' or 'spotted' in Italian.",
      "origin": "Italy",
      "caffeineContent": "High",
      "servingSize": "30-60ml",
      "ingredients": ["Espresso", "Milk or milk foam"],
      "flavorProfile": "Strong, bold, with a hint of creaminess."
    },
    {
      "id": 7,
      "name": "Flat White",
      "url": { "img": "https://github.com/saeed0920/Coffee-s-IMG/blob/main/Flat_white.jpg" },
      "description": "A coffee drink consisting of a shot of espresso topped with a thin layer of steamed milk, offering a strong coffee flavor with a creamy texture.",
      "origin": "Australia",
      "caffeineContent": "Medium",
      "servingSize": "180ml",
      "ingredients": ["Espresso", "Steamed milk"],
      "flavorProfile": "Smooth, velvety, with a strong espresso flavor."
    }
  ],
  "different": [
    {
      "coffee1": "Espresso",
      "coffee2": "Latte",
      "comparisonDescription": "Espresso is a concentrated coffee served in a small cup, while Latte is made with one part espresso and three parts steamed milk, resulting in a creamy texture. Espresso has a high caffeine content and a serving size of 30-50ml, whereas Latte has a medium caffeine content and a larger serving size of 240ml."
    },
    {
      "coffee1": "Espresso",
      "coffee2": "Cappuccino",
      "comparisonDescription": "Espresso is a strong coffee served in a small cup, while Cappuccino consists of equal parts espresso, steamed milk, and milk foam, often topped with cocoa powder. Both have high caffeine content, but Cappuccino has a serving size of 180ml and a creamier texture due to the milk foam."
    },
    {
      "coffee1": "Espresso",
      "coffee2": "Americano",
      "comparisonDescription": "Espresso is a concentrated coffee served in a small cup, while Americano is made by diluting espresso with hot water, resulting in a smoother flavor. Americano has a similar strength to drip coffee but with a different flavor profile, and it is typically served in a larger size of 240ml."
    },
    {
      "coffee1": "Espresso",
      "coffee2": "Mocha",
      "comparisonDescription": "Espresso is a strong coffee served alone, while Mocha combines espresso with steamed milk and chocolate syrup, often topped with whipped cream. Mocha has a sweet, chocolatey flavor and a medium caffeine content, served in 240ml."
    },
    {
      "coffee1": "Espresso",
      "coffee2": "Macchiato",
      "comparisonDescription": "Espresso is a concentrated coffee served in a small cup, while Macchiato is espresso 'stained' with a small amount of milk or milk foam. Macchiato has a high caffeine content and a serving size of 30-60ml, making it stronger than a Latte or Cappuccino."
    },
    {
      "coffee1": "Espresso",
      "coffee2": "Flat White",
      "comparisonDescription": "Espresso is a concentrated coffee served alone, while Flat White consists of a shot of espresso topped with a thin layer of steamed milk, offering a strong coffee flavor with a creamy texture. Flat White is typically served in 180ml."
    },
    {
      "coffee1": "Latte",
      "coffee2": "Cappuccino",
      "comparisonDescription": "Latte is a smooth, milky coffee made with more steamed milk compared to Cappuccino, which has equal parts espresso, steamed milk, and milk foam. Latte has a larger serving size of 240ml, while Cappuccino is served in 180ml and has a frothier texture."
    },
    {
      "coffee1": "Latte",
      "coffee2": "Americano",
      "comparisonDescription": "Latte is a creamy coffee made with steamed milk, while Americano is made by diluting espresso with hot water, resulting in a smooth flavor. Both have medium caffeine content, but Latte has a larger serving size of 240ml, while Americano is also served in 240ml but without milk."
    },
    {
      "coffee1": "Latte",
      "coffee2": "Mocha",
      "comparisonDescription": "Latte is a milky coffee with a subtle coffee flavor, while Mocha is a chocolate-flavored coffee drink made with espresso, steamed milk, and chocolate syrup. Both have a medium caffeine content and a serving size of 240ml, but Mocha has a sweeter, chocolatey taste."
    },
    {
      "coffee1": "Latte",
      "coffee2": "Macchiato",
      "comparisonDescription": "Latte is a creamy coffee made with steamed milk, while Macchiato is a strong espresso 'stained' with a small amount of milk or milk foam. Latte has a larger serving size of 240ml and a milder flavor, whereas Macchiato has a high caffeine content and a smaller serving size of 30-60ml."
    },
    {
      "coffee1": "Latte",
      "coffee2": "Flat White",
      "comparisonDescription": "Latte is made with more steamed milk compared to Flat White, which consists of a shot of espresso topped with a thin layer of steamed milk. Both have a creamy texture, but Flat White has a stronger coffee flavor and is typically served in 180ml."
    },
    {
      "coffee1": "Cappuccino",
      "coffee2": "Americano",
      "comparisonDescription": "Cappuccino is a creamy coffee drink made with equal parts espresso, steamed milk, and milk foam, while Americano is made by diluting espresso with hot water. Cappuccino has a frothy texture and is served in 180ml, whereas Americano is smoother and served in 240ml."
    },
    {
      "coffee1": "Cappuccino",
      "coffee2": "Mocha",
      "comparisonDescription": "Cappuccino is a balanced coffee drink with equal parts espresso, steamed milk, and milk foam, while Mocha combines espresso, steamed milk, and chocolate syrup. Both have medium caffeine content, but Cappuccino is typically served in 180ml, while Mocha is served in 240ml with a sweeter flavor."
    },
    {
      "coffee1": "Cappuccino",
      "coffee2": "Macchiato",
      "comparisonDescription": "Cappuccino is a creamy coffee drink made with equal parts espresso, steamed milk, and milk foam, while Macchiato is a strong espresso 'stained' with a small amount of milk. Cappuccino has a larger serving size of 180ml and a frothy texture, whereas Macchiato has a high caffeine content and a smaller serving size of 30-60ml."
    },
    {
      "coffee1": "Cappuccino",
      "coffee2": "Flat White",
      "comparisonDescription": "Cappuccino features equal parts espresso, steamed milk, and milk foam, while Flat White consists of a shot of espresso topped with a thin layer of steamed milk. Both have medium caffeine content, but Flat White has a stronger coffee flavor and is typically served in 180ml."
    },
    {
      "coffee1": "Americano",
      "coffee2": "Mocha",
      "comparisonDescription": "Americano is made by diluting espresso with hot water, resulting in a smooth flavor, while Mocha combines espresso, steamed milk, and chocolate syrup for a sweet taste. Both have medium caffeine content, but Americano is served in 240ml without milk, while Mocha is also served in 240ml with chocolate."
    },
    {
      "coffee1": "Americano",
      "coffee2": "Macchiato",
      "comparisonDescription": "Americano is a diluted espresso with hot water, resulting in a smooth flavor, while Macchiato is a strong espresso 'stained' with a small amount of milk. Americano has a medium caffeine content and a serving size of 240ml, whereas Macchiato has a high caffeine content and a smaller serving size of 30-60ml."
    },
    {
      "coffee1": "Americano",
      "coffee2": "Flat White",
      "comparisonDescription": "Americano is made by diluting espresso with hot water, while Flat White consists of a shot of espresso topped with a thin layer of steamed milk. Americano has a smooth flavor and is served in 240ml, whereas Flat White has a creamier texture and is typically served in 180ml."
    },
    {
      "coffee1": "Mocha",
      "coffee2": "Macchiato",
      "comparisonDescription": "Mocha is a chocolate-flavored coffee drink made with espresso, steamed milk, and chocolate syrup, while Macchiato is a strong espresso 'stained' with a small amount of milk. Mocha has a medium caffeine content and a serving size of 240ml, while Macchiato has a high caffeine content and a smaller serving size of 30-60ml."
    },
    {
      "coffee1": "Mocha",
      "coffee2": "Flat White",
      "comparisonDescription": "Mocha is a sweet, chocolate-flavored coffee drink made with espresso, steamed milk, and chocolate syrup, while Flat White consists of a shot of espresso topped with a thin layer of steamed milk. Both have medium caffeine content and a serving size of 240ml, but Mocha has a richer, sweeter flavor."
    },
    {
      "coffee1": "Macchiato",
      "coffee2": "Flat White",
      "comparisonDescription": "Macchiato is a strong coffee drink made with espresso and a small amount of milk, while Flat White consists of espresso topped with a thin layer of steamed milk. Macchiato has a high caffeine content and a smaller serving size of 30-60ml, whereas Flat White has a medium caffeine content and a serving size of 180ml."
    }
  ],
  "coffeebeans": [
    {
      "id": 1,
      "name": "Arabica",
      "description": "Arabica is the most widely consumed coffee bean variety, known for its smooth, mild, and nuanced flavor profile. It often has sweet, fruity, and floral notes with a hint of acidity, which can range from crisp to wine-like. Arabica beans are grown at high altitudes, typically above 600 meters, and are more susceptible to pests and diseases, making them more expensive. They account for about 60-70% of global coffee production."
    },
    {
      "id": 2,
      "name": "Robusta",
      "description": "Robusta beans are known for their strong, bold, and bitter flavor, often described as earthy or nutty with a hint of chocolate. They have nearly double the caffeine content of Arabica, giving them a harsher, more intense taste. Robusta is easier to grow, resistant to pests and diseases, and thrives at lower altitudes, which makes it more affordable. It is commonly used in espresso blends for its crema and in instant coffee."
    },
    {
      "id": 3,
      "name": "Liberica",
      "description": "Liberica is a rare variety of coffee bean, known for its unique smoky, woody, and floral flavors, with a somewhat fruity undertone. The beans themselves are irregular in size and shape, which contributes to their distinctive aroma and taste. Liberica is mainly grown in Southeast Asia, particularly in the Philippines, and represents only a small percentage of the world’s coffee production. It is considered an acquired taste due to its bold, unusual flavor profile."
    },
    {
      "id": 4,
      "name": "Excelsa",
      "description": "Excelsa is a variety of Liberica, but it has a very different flavor profile, often described as tart and fruity with a more complex, layered taste. It is used primarily in coffee blends to add depth and a mysterious twist to the flavor. Excelsa beans are grown in Southeast Asia and are relatively rare. The beans are smaller and rounder compared to other varieties, and they are often roasted dark to highlight their fruity and wine-like characteristics."
    },
    {
      "id": 5,
      "name": "Maragogipe",
      "description": "Maragogipe, also known as 'Elephant Bean' due to its unusually large size, is a mutation of the Arabica bean. It has a mild and delicate flavor with a smooth body and low acidity, often characterized by floral and fruity notes. Maragogipe beans are rare and highly prized, especially in regions like Central and South America, where they are primarily grown."
    },
    {
      "id": 6,
      "name": "Bourbon",
      "description": "Bourbon is a variety of Arabica that is cherished for its rich, sweet flavor profile. It often features complex notes of caramel, chocolate, and red fruit. Bourbon beans are known for their high-quality yield and are grown in countries like Brazil, Rwanda, and Burundi. The plant is more susceptible to diseases, which makes its production limited and more costly."
    },
    {
      "id": 7,
      "name": "Typica",
      "description": "Typica is one of the oldest and most foundational Arabica varieties. It is known for producing high-quality coffee with clean, sweet flavors, often accompanied by fruity or floral notes. While Typica plants have lower yields compared to other varieties, they are still sought after for their excellent cup quality, particularly in specialty coffee markets."
    },
    {
      "id": 8,
      "name": "Catuai",
      "description": "Catuai is a hybrid coffee variety derived from the Mundo Novo and Caturra plants. It is known for its high yields and resistance to wind and weather conditions. Catuai beans typically have a balanced flavor profile, with moderate acidity and sweetness, and are commonly grown in Brazil and Central America."
    },
    {
      "id": 9,
      "name": "SL28",
      "description": "SL28 is a coffee variety known for its drought resistance and its ability to produce exceptionally high-quality beans. Originating in Kenya, SL28 is prized for its bright acidity, juicy fruit notes, and rich body. The flavor is often complex, with citrus, berry, and wine-like characteristics. It is a favorite among specialty coffee producers."
    },
    {
      "id": 10,
      "name": "Geisha",
      "description": "Geisha (or Gesha) is one of the most expensive and sought-after coffee varieties, known for its exceptional and complex flavor profile. Originating from Ethiopia and now grown in countries like Panama, Geisha beans are famous for their floral aroma, vibrant acidity, and unique tasting notes that include jasmine, tropical fruit, and bergamot. Geisha beans have won numerous awards in coffee competitions and are considered a luxury among coffee connoisseurs."
    }
  ]
}
